/*
 * Copyright (C) © 2014 深圳市掌玩网络技术有限公司
 * KoTvGameBox
 * NetWorkManager.java
 */
package cn.vszone.ko.plugin.sdk;

import android.content.Context;
import android.net.ConnectivityManager;
import android.net.NetworkInfo;

/**
 * @author Jin BinBin
 * @Create at 2014-10-11 下午4:11:45
 * @Version 1.0
 * <p><strong>Features draft description.管理网络连接情况</strong></p>
 */
public class NetWorkManager {

    // ===========================================================
    // Constants
    // +==========================================================

    // -==========================================================

    // ===========================================================
    // Fields
    // +==========================================================

    // -==========================================================

    // ===========================================================
    // Constructors
    // +==========================================================

    // -==========================================================

    // ===========================================================
    // Getter & Setter
    // +==========================================================

    // -==========================================================

    // ===========================================================
    // Methods for/from SuperClass/Interfaces
    // +==========================================================

    // -==========================================================

    // ===========================================================
    // Methods
    // +==========================================================

    public static boolean hasNetWork(Context pContext) {
        ConnectivityManager cm = (ConnectivityManager) pContext.getSystemService(Context.CONNECTIVITY_SERVICE);   
        if (cm != null) {
           NetworkInfo info = cm.getActiveNetworkInfo();
           if (info == null) {
               return false;
           } else {
               return info.isAvailable();
           }
        } 
        return false;   
    }

    // -==========================================================

    // ===========================================================
    // Inner and Anonymous Classes
    // +==========================================================

    // -==========================================================
}
